<template>
  <div class="quota2022 quota">
    <div class="site-container">
      <div class="quota-list">
        <div class="quota-title">Квоты приема на 2021/2022 учебный год</div>
        <div class="quota-wrap">
          <b-table :items="items" :fields="fields"></b-table>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import axios from "axios";
export default {
  data() {
    return {
      fields: [
        {
          key: "Названия_вуза",
          sortable: true,
        },
        {
          key: "Приём",
          sortable: true,
        },
        {
          key: "Грант",
          sortable: true,
        },
        {
          key: "Контракт",
          sortable: true,
        },
      ],
      items: [
        {
          id: 1,
          Названия_вуза:
            "Узбекский государственный институт искусств и культуры",
          Приём: 585,
          Грант: 80,
          Контракт: 505,
        },
        {
          id: 2,
          Названия_вуза: "Андижанский государственный медицинский институт",
          Приём: 775,
          Грант: 360,
          Контракт: 415,
        },
        {
          id: 3,
          Названия_вуза: "Андижанский государственный университет",
          Приём: 1300,
          Грант: 325,
          Контракт: 975,
        },
        {
          id: 4,
          Названия_вуза: "Андижанский институт экономики и строительства",
          Приём: 425,
          Грант: 55,
          Контракт: 370,
        },
        {
          id: 5,
          Названия_вуза: "Бухарский государственный университет",
          Приём: 2644,
          Грант: 704,
          Контракт: 1940,
        },
        {
          id: 6,
          Названия_вуза: "Государственная консерватория Узбекистана",
          Приём: 270,
          Грант: 96,
          Контракт: 174,
        },
        {
          id: 7,
          Названия_вуза: "Гулистанский государственный университет",
          Приём: 2194,
          Грант: 594,
          Контракт: 1600,
        },
        {
          id: 8,
          Названия_вуза: "Джизакский политехнический институт",
          Приём: 1800,
          Грант: 500,
          Контракт: 1300,
        },
        {
          id: 9,
          Названия_вуза: "Каракалпакский государственный университет",
          Приём: 3950,
          Грант: 920,
          Контракт: 3030,
        },
        {
          id: 10,
          Названия_вуза: "Каршинский государственный университет",
          Приём: 1625,
          Грант: 375,
          Контракт: 1250,
        },
        {
          id: 11,
          Названия_вуза: "Кокандский государственный педагогический институт",
          Приём: 1750,
          Грант: 490,
          Контракт: 1260,
        },
        {
          id: 12,
          Названия_вуза: "Медицинский институт Каракалпакстана",
          Приём: 475,
          Грант: 200,
          Контракт: 275,
        },
        {
          id: 13,
          Названия_вуза: "Навоийский государственный горный институт",
          Приём: 605,
          Грант: 165,
          Контракт: 440,
        },
        {
          id: 14,
          Названия_вуза: "Наманганский государственный университет",
          Приём: 2473,
          Грант: 603,
          Контракт: 1870,
        },
        {
          id: 15,
          Названия_вуза: "Наманганский инженерно-технологический институт",
          Приём: 1675,
          Грант: 395,
          Контракт: 1280,
        },
        {
          id: 16,
          Названия_вуза: "Национальный университет Узбекистана",
          Приём: 3583,
          Грант: 854,
          Контракт: 2729,
        },
        {
          id: 17,
          Названия_вуза:
            "Ташкентский университет информационных технологий Нукусский филиал",
          Приём: 625,
          Грант: 140,
          Контракт: 485,
        },
        {
          id: 18,
          Названия_вуза: "Самаркандский государственный университет",
          Приём: 1942,
          Грант: 507,
          Контракт: 1435,
        },
        {
          id: 19,
          Названия_вуза: "Самаркандский медицинский институт ветеринарии",
          Приём: 1300,
          Грант: 400,
          Контракт: 900,
        },
        {
          id: 20,
          Названия_вуза:
            "Ташкентский университет информационных технологий Самаркандский филиал",
          Приём: 450,
          Грант: 110,
          Контракт: 340,
        },
        {
          id: 21,
          Названия_вуза: "Ташкентская медицинская академия",
          Приём: 1200,
          Грант: 565,
          Контракт: 635,
        },
        {
          id: 22,
          Названия_вуза: "Ташкентский исламский университет",
          Приём: 175,
          Грант: 60,
          Контракт: 115,
        },
        {
          id: 23,
          Названия_вуза: "Ташкентский фармацевтический институт",
          Приём: 500,
          Грант: 170,
          Контракт: 330,
        },
        {
          id: 24,
          Названия_вуза: "Ташкентский финансовый институт",
          Приём: 725,
          Грант: 85,
          Контракт: 640,
        },
        {
          id: 25,
          Названия_вуза: "Термезский государственный университет",
          Приём: 1673,
          Грант: 428,
          Контракт: 1245,
        },
        {
          id: 26,
          Названия_вуза: "Ферганский государственный университет",
          Приём: 2571,
          Грант: 606,
          Контракт: 1965,
        },
        {
          id: 27,
          Названия_вуза:
            "Ферганский медицинский институт общественного здоровья",
          Приём: 400,
          Грант: 165,
          Контракт: 235,
        },
        {
          id: 28,
          Названия_вуза: "Ферганский политехнический институт",
          Приём: 2350,
          Грант: 585,
          Контракт: 1765,
        },
        {
          id: 29,
          Названия_вуза:
            "Ташкентский университет информационных техологий Ферганский филиал",
          Приём: 475,
          Грант: 100,
          Контракт: 375,
        },
        {
          id: 30,
          Названия_вуза:
            "Янгиерский филиал Ташкентского химико-технологического института",
          Приём: 450,
          Грант: 85,
          Контракт: 365,
        },
      ],
    };
  },

  mounted() {
    // axios.get(`http://localhost:3000/qabul_data`).then((res) => {
    //   this.items = res.data;
    // });

    setTimeout(() => {
      let list = document.querySelectorAll(".sr-only");
      for (let i = 0; i < list.length; i++) {
        list[i].style.display = "none";
      }
    }, 10);
  },
};
</script>

<style lang="scss">
.quota {
  &-search {
    input {
      width: 100%;
      height: 40px;
      outline: none;
      font-size: 16px;
      line-height: 20px;
      margin-bottom: 40px;
      padding: 0 12px;
      border: 1px solid #333;
      border-radius: 6px;
    }
  }
  &-title {
    font-size: 24px;
    line-height: 28px;
    margin-bottom: 32px;
    text-align: center;
    font-weight: 500;
  }

  table {
    font-size: 14px;

    th {
      font-size: 16px;
      padding: 10px 20px 10px 10px;
    }
    td {
      padding: 20px 20px 20px 10px;
      font-size: 16px;

      &:nth-child(1) {
        width: 61%;
      }
      &:nth-child(2),
      &:nth-child(3),
      &:nth-child(4) {
        width: 13%;
      }
    }
  }
}
.hide {
  display: none;
}
</style>
